### Pandas : Tratamiento datos nulos o sin valor

In [1]:
import numpy as np
import pandas as pd

In [2]:
diccionario = {'A':[4,5,np.nan], 'B':[6,1,5], 'C':[np.nan, 4,np.nan]}

In [3]:
dataframe = pd.DataFrame(diccionario)

In [4]:
dataframe

     A  B    C
0  4.0  6  NaN
1  5.0  1  4.0
2  NaN  5  NaN

In [7]:
dataframe.dropna()

     A  B    C
1  5.0  1  4.0

In [10]:
dataframe.dropna(axis=1)

   B
0  6
1  1
2  5

In [11]:
dataframe

     A  B    C
0  4.0  6  NaN
1  5.0  1  4.0
2  NaN  5  NaN

In [ ]:
dataframe,fillna